In [89]:
import numpy as np
import pandas as pd

In [90]:
df=pd.read_csv('data/births.csv')
df.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [167]:
df.groupby(['year'])['births'].sum()

year
1969    3600206
1970    3737800
1971    3563548
1972    3266235
1973    3146125
1974    3170631
1975    3153556
1976    3176476
1977    3332159
1978    3338300
1979    3499795
1980    3617981
1981    3635515
1982    3685457
1983    3642821
1984    3673568
1985    3765064
1986    3760695
1987    3813216
1988    3913793
1989    4045693
1990    4162917
1991    4115342
1992    4069428
1993    4004523
1994    3956925
1995    3903012
1996    3894874
1997    3884329
1998    3945192
1999    3963465
2000    4063823
2001    4031531
2002    4027376
2003    4096092
2004    4118907
2005    4145619
2006    4273225
2007    4324008
2008    4255156
Name: births, dtype: int64

In [165]:
df['year'].value_counts().reset_index().sort_values(by='index', ascending=False)

    index  year
32   2008    24
39   2007    24
24   2006    24
25   2005    24
29   2004    24
35   2003    24
37   2002    24
20   2001    24
28   2000    24
27   1999    24
21   1998    24
30   1997    24
34   1996    24
36   1995    24
38   1994    24
33   1993    24
23   1992    24
26   1991    24
22   1990    24
31   1989    24
16   1988   739
19   1987   733
18   1986   736
17   1985   737
13   1984   747
10   1983   749
11   1982   748
15   1981   745
14   1980   747
12   1979   747
7    1978   761
9    1977   761
8    1976   761
5    1975   763
2    1974   766
6    1973   762
3    1972   765
4    1971   764
0    1970   768
1    1969   768

In [91]:
df.shape

(15547, 5)

In [104]:
df.dtypes

year        int64
month       int64
day       float64
gender     object
births      int64
dtype: object

In [132]:
df[[x for x in df.columns if (df[x].dtype == 'float64') | ( df[x].dtype=='O')]].dropna()

        day gender
0       1.0      F
1       1.0      M
2       2.0      F
3       2.0      M
4       3.0      F
...     ...    ...
15062  29.0      M
15063  30.0      F
15064  30.0      M
15065  31.0      F
15066  31.0      M

[15067 rows x 2 columns]

In [152]:
c = {}
c['abc'] = 34
c

{'abc': 34}

In [155]:
from collections import Counter


str1 = 'act'
str2 = 'cat'
dict1 = {}
dict2 = {}

def anagram(str1, str2):
    
    str1 = str1.lower().replace("", " ")
    str2 = str2.lower().replace("", " ")
    print(str1)
    print(str2)
    return Counter(str1)==Counter(str2)
    
anagram(str1, str2)

 a c t
 c a t

True

In [156]:
def imp_counter(str1):
    
    c ={}
    for i in str1:
        if i in c :
            c[i]+= 1
            
        else :
            c[i] = 1
    return c
s = 'aabbaaccdd'
imp_counter(s)

{'a': 4, 'b': 2, 'c': 2, 'd': 2}

In [142]:
'Abhi'.replace("", ' ').split()

['A', 'b', 'h', 'i']

In [ ]:
def implement_counter(str1):
    x = {}

In [136]:
from collections import Counter
Counter('AABBHHII Ma')

Counter({'A': 2, 'B': 2, 'H': 2, 'I': 2, ' ': 1, 'M': 1, 'a': 1})

In [134]:
anagram(str1, str2)

a
c
t
c
a
t

In [10]:
# Python program to merge 
# dataframes using Panda 

# Dataframe created 
left = pd.DataFrame({'Key': ['K0', 'K0', 'K2', 'K3'], 
                     'A': ['A0', 'A0', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3']}) 

right = pd.DataFrame({'Key': [ 'K0'], 
                        'A': [ 'A0'], 
                        'D': ['Daku0']}) 

left

  Key   A   B
0  K0  A0  B0
1  K0  A0  B1
2  K2  A2  B2
3  K3  A3  B3

In [11]:
right

  Key   A      D
0  K0  A0  Daku0

In [12]:
# Merging the dataframes
left.merge( right, how = 'inner', on = ['Key','A'])

  Key   A   B      D
0  K0  A0  B0  Daku0
1  K0  A0  B1  Daku0

In [ ]:
new_df = pd.merge(A_df, B_df,  how='left', left_on=['A_c1','c2'], right_on = ['B_c1','c2'])